Revit 2026 API

# BuildingEnvelopeAnalyzer Properties

---

The BuildingEnvelopeAnalyzer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

BuildingEnvelopeAnalyzer Class

Autodesk.Revit.DB.Analysis Namespace